In [1]:
import sqlite3

In [2]:
con = sqlite3.connect("students.sqlite3")

In [3]:
cur = con.cursor()

In [4]:
CREATE_TABLE_QUERY="""
    CREATE table student(
        id int primary key,
        name varchar not null,
        address varchar not null,
        college varchar not null,
        age int not null,
        gender varchar(1) not null,
        faculty varchar not null
    );

"""
cur.execute(CREATE_TABLE_QUERY)

In [5]:
INSERT_RECORDS="""
INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty')
values
(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT'),
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT'),
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE'),
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f','CE');

"""
cur.execute(INSERT_RECORDS)

In [6]:
con.commit()

In [7]:
students = cur.execute("SELECT * from student;")
print(students)

<sqlite3.Cursor object at 0x11057cbc0>

In [8]:
for student in students:
    print(student)

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT')
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE')

In [9]:
for student in students:
    print(student)

In [10]:
cur.execute("ALTER table student add university varchar not null default 'tu';")
con.commit()

In [11]:
cur.execute("""

INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty', 'university')
values
(5, 'hari', 'kathmandu', 'ioe pulchowk', 24, 'm','CIVIL', 'ku'),
(6, 'madan', 'pokhara', 'ncit', 21, 'f', 'SE', 'tu'),
(7, 'maya', 'kathmandu', 'isglington', 24, 'f','BIT', 'tu');

""")

con.commit()

In [12]:
students = cur.execute("""SELECT * FROM student where address = 'lalitpur';""")
for student in students:
    print(student)

(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'tu')

In [13]:
address = input("Enter the address: ")
students = cur.execute(f"""SELECT * FROM student where address = '{address}';""")
for student in students:
    print(student)

Enter the address:  kathmandu

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'tu')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE', 'tu')
(5, 'hari', 'kathmandu', 'ioe pulchowk', 24, 'm', 'CIVIL', 'ku')
(7, 'maya', 'kathmandu', 'isglington', 24, 'f', 'BIT', 'tu')

In [14]:
address = input("Enter the address: ")
students = cur.execute(f"""SELECT * FROM student where address = '{address}';""") # SQL injection
for student in students:
    print(student)

Enter the address:  lalitpur' or address = 'kathmandu

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'tu')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'tu')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE', 'tu')
(5, 'hari', 'kathmandu', 'ioe pulchowk', 24, 'm', 'CIVIL', 'ku')
(7, 'maya', 'kathmandu', 'isglington', 24, 'f', 'BIT', 'tu')

In [15]:
# SELECT * FROM student where address = 'lalitpur' or address = 'kathmandu';

In [17]:
address = input("Enter the address: ")
students = cur.execute("""SELECT * FROM student where address = ?;""", (address,))
for student in students:
    print(student)

Enter the address:  lalitpur' or address = 'kathmandu

In [18]:
student = (11, 'ramesh pradhan', 'lalitpur', 'ncit', 23, 'm', "IT", "TU")

INSERT_RECORDS="""
INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty' ,'university')
values
(?, ?, ?, ?, ?, ?, ?, ?);
"""
cur.execute(INSERT_RECORDS, student)
con.commit()

In [19]:
students = [
    (8, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', "SE", "PU"),
    (9, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', "IT", 'UK'),
    (10, 'maya devi', 'lalitpur', 'ncit', 21, 'f', "CE", "PU"),
]

INSERT_RECORDS="""
INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty' ,'university')
values
(?, ?, ?, ?, ?, ?, ?, ?);
"""

for student in students:
    cur.execute(INSERT_RECORDS, student) # single insert
    con.commit()

In [20]:
students = [
    (13, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', "SE", "PU"),
    (14, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', "IT", 'UK'),
    (15, 'maya devi', 'lalitpur', 'ncit', 21, 'f', "CE", "PU"),
]
INSERT_RECORDS="""
INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty' ,'university')
values
(?, ?, ?, ?, ?, ?, ?, ?);
"""

cur.executemany(INSERT_RECORDS, students) # bulk insert
con.commit()

In [1]:
x = [1,2,3,4,5]
for i in x:
    print(i)

1
2
3
4
5

In [2]:
x = [1,2,3,4,5]
for i, value in enumerate(x):
    print(i, value)

0 1
1 2
2 3
3 4
4 5

In [1]:
def addition(a, y):
    return a+y

In [ ]:
x = 1
y = 2

addition(x, y)